src/cf/Catalogs/уатКлассификаторыКатегорийТСЕЭК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатКлассификаторыКатегорийТСЕЭК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаПаспортаТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатКлассификаторыКатегорийТСЕЭК/Forms/ПодборКатегорийТСИзКлассификатора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗакрыватьПриВыборе = Ложь;
	ИмяМакета = "МакетКлассификатора";
	ЗаполнитьТаблицуТиповТС(ИмяМакета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура КатегорииТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборВСпискеТиповТС(СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьВыполнить()
	
	ОбработатьВыборВСпискеТиповТС();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТиповТС(ИмяМакета)
	
	КатегорииТС.Очистить();
	
	МакетДанных = Справочники.уатКлассификаторыКатегорийТСЕЭК.ПолучитьМакет("МакетКлассификатора");
	КолСтрок = МакетДанных.ВысотаТаблицы;
	Для сч = 2 По КолСтрок Цикл
		НоваяСтрока = КатегорииТС.Добавить();
		НоваяСтрока.Код = МакетДанных.Область(сч,1,сч,1).Текст;
		НоваяСтрока.Наименование = МакетДанных.Область(сч,2,сч,2).Текст;
		НоваяСтрока.Описание = МакетДанных.Область(сч,3,сч,3).Текст;
		НоваяСтрока.КодВидаПаспортаТС = МакетДанных.Область(сч,4,сч,4).Текст;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьВыбранныеСтроки(Знач ВыбранныеСтроки)
	
	ТекущаяСсылка = Неопределено;
	ТекущийСправочник = Справочники.уатКлассификаторыКатегорийТСЕЭК;
	
	Для каждого НомерСтроки Из ВыбранныеСтроки Цикл
		ТекущиеДанные = КатегорииТС.НайтиПоИдентификатору(НомерСтроки);
		
		тКод = ТекущиеДанные.Код;
		тНаименование = ТекущиеДанные.Наименование;
		
		СтрокаВБазе = ТекущийСправочник.НайтиПоНаименованию(СокрЛП(тНаименование), Истина);
		// Либо такой элемент в справочнике уже есть
		Если ЗначениеЗаполнено(СтрокаВБазе) Тогда
			Если НомерСтроки = Элементы.КатегорииТС.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
				ТекущаяСсылка = СтрокаВБазе;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Либо этот элемент нужно создать
		КатегорияТС = ТекущийСправочник.СоздатьЭлемент();
		КатегорияТС.Код = тКод;
		КатегорияТС.Наименование = тНаименование;
		КатегорияТС.Описание = ТекущиеДанные.Описание;
		КатегорияТС.КодВидаПаспортаТС = ТекущиеДанные.КодВидаПаспортаТС;
		КатегорияТС.Записать();
	
		Если НомерСтроки = Элементы.КатегорииТС.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
			ТекущаяСсылка = КатегорияТС.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущаяСсылка;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыборВСпискеТиповТС(СтандартнаяОбработка = Неопределено)
		
	// Добавление элемента справочника и вывод результата пользователю.
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСсылка = СохранитьВыбранныеСтроки(Элементы.КатегорииТС.ВыделенныеСтроки);
	
	ОповеститьОВыборе(ТекущаяСсылка);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Категории ТС добавлены.'; en = 'Vehicle categories have been added.'"), , , БиблиотекаКартинок.Информация32);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
